In [11]:
import pandas as pd
import sqlalchemy

In [12]:
engine=sqlalchemy.create_engine('mysql+pymysql://root:@localhost:3306/python')

In [14]:
df=pd.read_sql_table("customers",engine)
df

   id     name     phone
0   1    azrin  98765431
1   2     rana     45678
2   3  rakibul     56789
3   4     liam    753312

In [15]:
df=pd.read_sql_table("customers",engine,columns=["name"])
df

      name
0    azrin
1     rana
2  rakibul
3     liam

In [16]:
df=pd.read_sql_table("customers",engine,columns=["name","id"]) #printing specific columns
df

      name  id
0    azrin   1
1     rana   2
2  rakibul   3
3     liam   4

In [17]:
df=pd.read_csv("orders.csv")
df

   id company name  amount
0   1        daraz       5
1   2           bd      68
2   3         chal    3445
3   4          dal      54

In [18]:

df=df.rename(columns={
   'company name':"cname",
    'amount':"tk"
})
df

   id  cname    tk
0   1  daraz     5
1   2     bd    68
2   3   chal  3445
3   4    dal    54

In [21]:
df.to_sql(name="orders", #csv to databasre table
          con=engine,
          if_exists="fail",
          index=False)

In [22]:
pd.read_sql_table("orders",engine)

   id  cname    tk
0   1  daraz     5
1   2     bd    68
2   3   chal  3445
3   4    dal    54

In [25]:
query = ''' 
 SELECT customers.name, customers.phone, orders.cname, orders.tk
 FROM customers INNER JOIN orders
 ON customers.id=orders.id
'''
df = pd.read_sql_query(query,engine) #joining query 
df

      name     phone  cname    tk
0    azrin  98765431  daraz     5
1     rana     45678     bd    68
2  rakibul     56789   chal  3445
3     liam    753312    dal    54

In [26]:
pd.read_sql("orders",engine) # read_sql can be used as alternative to read_sql_table and pd.read_sql_query

   id  cname    tk
0   1  daraz     5
1   2     bd    68
2   3   chal  3445
3   4    dal    54